<template>
	<div>
		<el-alert type="success" :closable="false" title="基础">
			架构：基于iframe，无后台代码，纯html模板，可方便的适配任何后端语言 <br/>
			模板：提供大量常见示例，以及各种表单的书写方式，助你快速CRUD  <br/>
			菜单：支持一、二、三级菜单，并开放一系列接口方便的使用js操作菜单 <br/>
			折叠：折叠或收缩菜单，并且监听窗口大小变化，在拉伸窗口时自动折叠或收缩菜单，自动响应式 <br/>
			搜索：智能索引，快捷搜索打开某个菜单 <br/>
			切换：集成swiper动画，滑动、淡入、方块、3D流、3D翻转，五种高大上切换动画，任你选择！ <br/>
			主题：目前保留八种主题：蓝色、绿色、白色、灰色、灰色-展开、pro钛合金、沉淀式黑蓝、简约式灰蓝（切换主题时，可自动保存你的喜好，下次打开时仍然有效） <br/>
			便签：弹出窗口便签，一个临时小便签，可记录一些临时资料 <br/>
			全屏：可以在全屏/非全屏之间自由切换 <br/>
		</el-alert>
		<el-alert type="warning" :closable="false" title="tabbar栏">	
			卡片堆积：多卡片自动堆积，与菜单双向关联，切换tab卡时自动显示左侧菜单 <br/>
			拖动手势：tab卡支持拖拽手势，上拖新窗口打开、下拽悬浮打开、左拽快速关闭 <br/>
			双击全屏：当卡片属于悬浮状态时，双击标题区域可以快速全屏，再次双击取消全屏 <br/>
			右键菜单：在tab上右击，可以：刷新、复制、关闭、关闭其它、关闭所有、悬浮打开、新窗口打开、取消 <br/>
			双击菜单：双击tabbar空白处，可以显示添加新tab窗口 <br/>
			保留高度：切换卡片时，可自动保留上个卡片的滚动条高度 <br/>
		</el-alert>
		<el-alert type="info" :closable="false" title="开放接口">	
			开放一系列api，助你方便的使用js操作tabbar栏，具体请查看集成文档 <br/>
			锚链：tab切换自动更改hash锚链，同时监听锚链改变tab，可灵活的用鼠标前后键切换tab窗口 （如不需要此功能可在初始化时关闭） <br/>
			窗口：可在初始化时，设置是否显示tabbar栏，来控制它是多窗口还是单窗口，具体见使用文档 <br/>
			更新：功能不断更新中... 你有好的想法也可以告诉我，加群一起交流吧 <br/>
			文档：使用说明，见文档 <br/>
		</el-alert>
	</div>
</template>

<script>
	module.exports = {
		data() {
			return {
				
			}
		},
		methods: {
			
		},
		created() {
			
		}
	}
</script>

<style scoped>
</style>
