// 在使用时，不建议你直接魔改模板的代码，以免在运行时出现意外bug，而是在本文件中根据模板的提供的API，来适应你的业务逻辑 
// ....



// ================================= 示例：一些基本信息 ================================= 

// 设置模板标题 
sp.title = "SA-后台模板";


// ================================= 示例：自定义菜单 =================================

var myMenuList = window.menuList;		// window.menuList 在 menu-list.js 中定义 
sp.menuList = myMenuList;

// 如果需要获得更多操作能力，如：动态添加菜单、删除菜单等
// 可直接 sp.menuList 获得菜单引用，直接操作对象 


// ================================= 示例：js控制打开某个菜单 =================================
// sp.selectMenu(id); 	// 菜单id


// ================================= 示例：设置user信息 =================================
// 用户登录后，右上角可直接显示用户的头像和昵称
sp.user = {
	username: 'root',	// 昵称 
	avatar: 'sa-resources/admin-logo.png'	// 头像地址  
}



// ================================= 示例：设置登录后的头像处，下拉可以出现的选项  =================================
sp.dropList = [		// 头像点击处可操作的选项
	{
		name: '我的资料',
		click: function() {
			sp.$message('点击了我的资料，你可以参照文档重写此函数');
		}
	},
	{
		name: '退出登录',
		click: function() {
			sp.$message('点击了退出登录，你可以参照文档重写此函数');
		}
	}
]


